# Conductor Size Dispose Method

Source: https://www.revitapidocs.com/2026/31f4ce46-2aa8-6995-dc8e-1da233dbd197.htm

---

| Conductor Size Dispose Method |
| --- |

Releases all resources used by the ConductorSize
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void Dispose()
```

```
Public Sub Dispose
```

```
public:
virtual void Dispose() sealed
```

```
abstract Dispose : unit -> unit
override Dispose : unit -> unit
```

#### Implements

IDisposable Dispose
See Also

#### Reference

ConductorSize Class Autodesk.Revit.DB.Electrical Namespace